In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("train.csv")
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [3]:
target = df.Survived

In [4]:
df.columns

Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [5]:
df.drop(['Name','SibSp','Parch','Ticket','Cabin', 'Embarked',],axis='columns',inplace=True)

In [6]:
df.head()

   Pclass     Sex   Age    Fare  Survived
0       2  female  29.0  26.000         1
1       3    male   NaN   8.050         0
2       2    male  39.0  26.000         0
3       3  female  29.0  21.075         0
4       3    male  25.0   7.050         0

In [7]:
inputs = df.drop(['Survived'],axis='columns')

In [8]:
inputs.head()

   Pclass     Sex   Age    Fare
0       2  female  29.0  26.000
1       3    male   NaN   8.050
2       2    male  39.0  26.000
3       3  female  29.0  21.075
4       3    male  25.0   7.050

In [9]:
inputs.isna().count()

Pclass    668
Sex       668
Age       668
Fare      668
dtype: int64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age.isna()

0      False
1      False
2      False
3      False
4      False
       ...
663    False
664    False
665    False
666    False
667    False
Name: Age, Length: 668, dtype: bool

In [11]:
inputs.Age.mean()

29.700559701492537

In [12]:
inputs.Age

0      29.00000
1      29.70056
2      39.00000
3      29.00000
4      25.00000
         ...
663    17.00000
664    29.70056
665    32.00000
666    22.00000
667    29.70056
Name: Age, Length: 668, dtype: float64

In [13]:
inputs.head()

   Pclass     Sex       Age    Fare
0       2  female  29.00000  26.000
1       3    male  29.70056   8.050
2       2    male  39.00000  26.000
3       3  female  29.00000  21.075
4       3    male  25.00000   7.050

In [14]:
inputs.isna().count()

Pclass    668
Sex       668
Age       668
Fare      668
dtype: int64

In [15]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target)

In [27]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

In [28]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [31]:
model.score(x_test,y_test)

0.9401197604790419